Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS606.h
#define _ADPCFG_PCFG0_POSITION                   0x00000000
#define _ADPCFG_PCFG0_MASK                       0x00000001
#define _ADPCFG_PCFG0_LENGTH                     0x00000001

#define _ADPCFG_PCFG1_POSITION                   0x00000001
#define _ADPCFG_PCFG1_MASK                       0x00000002
#define _ADPCFG_PCFG1_LENGTH                     0x00000001

#define _ADPCFG_PCFG2_POSITION                   0x00000002
#define _ADPCFG_PCFG2_MASK                       0x00000004
#define _ADPCFG_PCFG2_LENGTH                     0x00000001

#define _ADPCFG_PCFG3_POSITION                   0x00000003
#define _ADPCFG_PCFG3_MASK                       0x00000008
#define _ADPCFG_PCFG3_LENGTH                     0x00000001

#define _ADPCFG_PCFG4_POSITION                   0x00000004
#define _ADPCFG_PCFG4_MASK                       0x00000010
#define _ADPCFG_PCFG4_LENGTH                     0x00000001

#define _ADPCFG_PCFG5_POSITION                   0x00000005
#define _ADPCFG_PCFG5_MASK                       0x00000020
#define _ADPCFG_PCFG5_LENGTH                     0x00000001

#define _ADPCFG_PCFG6_POSITION                   0x00000006
#define _ADPCFG_PCFG6_MASK                       0x00000040
#define _ADPCFG_PCFG6_LENGTH                     0x00000001

#define _ADPCFG_PCFG7_POSITION                   0x00000007
#define _ADPCFG_PCFG7_MASK                       0x00000080
#define _ADPCFG_PCFG7_LENGTH                     0x00000001

#define _ADPCFG_PCFG8_POSITION                   0x00000008
#define _ADPCFG_PCFG8_MASK                       0x00000100
#define _ADPCFG_PCFG8_LENGTH                     0x00000001

#define _ADPCFG_PCFG9_POSITION                   0x00000009
#define _ADPCFG_PCFG9_MASK                       0x00000200
#define _ADPCFG_PCFG9_LENGTH                     0x00000001

#define _ADPCFG_PCFG10_POSITION                  0x0000000A
#define _ADPCFG_PCFG10_MASK                      0x00000400
#define _ADPCFG_PCFG10_LENGTH                    0x00000001

#define _ADPCFG_PCFG11_POSITION                  0x0000000B
#define _ADPCFG_PCFG11_MASK                      0x00000800
#define _ADPCFG_PCFG11_LENGTH                    0x00000001

#define _ADPCFG_PCFG12_POSITION                  0x0000000C
#define _ADPCFG_PCFG12_MASK                      0x00001000
#define _ADPCFG_PCFG12_LENGTH                    0x00000001

#define _ADPCFG_PCFG13_POSITION                  0x0000000D
#define _ADPCFG_PCFG13_MASK                      0x00002000
#define _ADPCFG_PCFG13_LENGTH                    0x00000001

#define _ADPCFG_PCFG14_POSITION                  0x0000000E
#define _ADPCFG_PCFG14_MASK                      0x00004000
#define _ADPCFG_PCFG14_LENGTH                    0x00000001

#define _ADPCFG_PCFG15_POSITION                  0x0000000F
#define _ADPCFG_PCFG15_MASK                      0x00008000
#define _ADPCFG_PCFG15_LENGTH                    0x00000001

#define _ADSTAT_P0RDY_POSITION                   0x00000000
#define _ADSTAT_P0RDY_MASK                       0x00000001
#define _ADSTAT_P0RDY_LENGTH                     0x00000001

#define _ADSTAT_P1RDY_POSITION                   0x00000001
#define _ADSTAT_P1RDY_MASK                       0x00000002
#define _ADSTAT_P1RDY_LENGTH                     0x00000001

#define _ADSTAT_P2RDY_POSITION                   0x00000002
#define _ADSTAT_P2RDY_MASK                       0x00000004
#define _ADSTAT_P2RDY_LENGTH                     0x00000001

#define _ADSTAT_P3RDY_POSITION                   0x00000003
#define _ADSTAT_P3RDY_MASK                       0x00000008
#define _ADSTAT_P3RDY_LENGTH                     0x00000001

#define _ADSTAT_P4RDY_POSITION                   0x00000004
#define _ADSTAT_P4RDY_MASK                       0x00000010
#define _ADSTAT_P4RDY_LENGTH                     0x00000001

#define _ADSTAT_P5RDY_POSITION                   0x00000005
#define _ADSTAT_P5RDY_MASK                       0x00000020
#define _ADSTAT_P5RDY_LENGTH                     0x00000001

#define _ADSTAT_P6RDY_POSITION                   0x00000006
#define _ADSTAT_P6RDY_MASK                       0x00000040
#define _ADSTAT_P6RDY_LENGTH                     0x00000001

#define _ADSTAT_P7RDY_POSITION                   0x00000007
#define _ADSTAT_P7RDY_MASK                       0x00000080
#define _ADSTAT_P7RDY_LENGTH                     0x00000001

#define _ADSTAT_P12RDY_POSITION                  0x0000000C
#define _ADSTAT_P12RDY_MASK                      0x00001000
#define _ADSTAT_P12RDY_LENGTH                    0x00000001

#define _ADCPC0_TRGSRC0_POSITION                 0x00000000
#define _ADCPC0_TRGSRC0_MASK                     0x0000001F
#define _ADCPC0_TRGSRC0_LENGTH                   0x00000005

#define _ADCPC0_SWTRG0_POSITION                  0x00000005
#define _ADCPC0_SWTRG0_MASK                      0x00000020
#define _ADCPC0_SWTRG0_LENGTH                    0x00000001

#define _ADCPC0_PEND0_POSITION                   0x00000006
#define _ADCPC0_PEND0_MASK                       0x00000040
#define _ADCPC0_PEND0_LENGTH                     0x00000001

#define _ADCPC0_IRQEN0_POSITION                  0x00000007
#define _ADCPC0_IRQEN0_MASK                      0x00000080
#define _ADCPC0_IRQEN0_LENGTH                    0x00000001

#define _ADCPC0_TRGSRC1_POSITION                 0x00000008
#define _ADCPC0_TRGSRC1_MASK                     0x00001F00
#define _ADCPC0_TRGSRC1_LENGTH                   0x00000005

#define _ADCPC0_SWTRG1_POSITION                  0x0000000D
#define _ADCPC0_SWTRG1_MASK                      0x00002000
#define _ADCPC0_SWTRG1_LENGTH                    0x00000001

#define _ADCPC0_PEND1_POSITION                   0x0000000E
#define _ADCPC0_PEND1_MASK                       0x00004000
#define _ADCPC0_PEND1_LENGTH                     0x00000001

#define _ADCPC0_IRQEN1_POSITION                  0x0000000F
#define _ADCPC0_IRQEN1_MASK                      0x00008000
#define _ADCPC0_IRQEN1_LENGTH                    0x00000001

#define _ADCPC0_TRGSRC00_POSITION                0x00000000
#define _ADCPC0_TRGSRC00_MASK                    0x00000001
#define _ADCPC0_TRGSRC00_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC01_POSITION                0x00000001
#define _ADCPC0_TRGSRC01_MASK                    0x00000002
#define _ADCPC0_TRGSRC01_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC02_POSITION                0x00000002
#define _ADCPC0_TRGSRC02_MASK                    0x00000004
#define _ADCPC0_TRGSRC02_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC03_POSITION                0x00000003
#define _ADCPC0_TRGSRC03_MASK                    0x00000008
#define _ADCPC0_TRGSRC03_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC04_POSITION                0x00000004
#define _ADCPC0_TRGSRC04_MASK                    0x00000010
#define _ADCPC0_TRGSRC04_LENGTH                  0x00000001

